[
  "table-editor-obsidian",
  "obsidian-image-auto-upload-plugin",
  "obsidian-git",
  "obsidian-tasks-plugin",
  "auto-card-link",
  "obsidian-excalidraw-plugin",
  "dataview",
  "quickadd",
  "obsidian-outliner",
  "recent-files-obsidian",
  "obsidian-admonition",
  "convert-url-to-iframe",
  "obsidian-copy-block-link",
  "copilot"
]